Table of Contents
 Class SteelSetupCISC
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Steel setup IBC class
public class SteelSetupCISC : SteelSetup
Inheritance
object
SteelSetup
SteelSetupCISC
Inherited Members
 SteelSetup.FrictionCoefficientPboltDefault()
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Anchor_Fiar
Safety factor Anchor_Fiar
public double Anchor_Fiar { get; set; }
Property Value
double
 Bolt_Fib
Safety factor Bolt_Fib
public double Bolt_Fib { get; set; }
Property Value
double
 Structural_Fi
Safety factor Structural_Fi
public double Structural_Fi { get; set; }
Property Value
double
 Weld_Fiw
Safety factor Weld_Fiw
public double Weld_Fiw { get; set; }
Property Value
double
 Edit this page